app/controllers/mitigations_controller.rb

SELECT * FROM "mitigations"
---
  def index
    @mitigations = Mitigation.all

SELECT * FROM "mitigations" WHERE ("mitigations"."id" = 1)
---
  def show
    @mitigation = Mitigation.find(params[:id])

SELECT * FROM "mitigations" WHERE ("mitigations"."id" = 1)
---
  def edit
    @mitigation = Mitigation.find(params[:id])

INSERT INTO "mitigations" ("scope", "responsible", "created_at", "notes", "updated_at", "audit", "recommendation", "issue", "risk", "status") VALUES('aldkjfa;dljf', 'ajkdf;adjfa;j', '2010-09-28 23:14:32', 'adsjkf;aldkfj', '2010-09-28 23:14:32', 'a;jf;adj;', 'ajd;fakdjflk', 'adsfadjkl', 1, 2)
---
  def create
    @mitigation = Mitigation.new(params[:mitigation])

    respond_to do |format|
      if @mitigation.save